scrable = {
    "A" : 1, "L" : 1, "А" : 1, "О" : 1,
    "E" : 1, "N" : 1, "В" : 1, "Р" : 1,
    "U" : 1, "S" : 1, "Е" : 1, "С" : 1,
    "I" : 1, "T" : 1, "И" : 1, "Т" : 1, 
    "O" : 1, "R" : 1, "Н" : 1,
    "D" : 2, "Д" : 2, "Л" : 2, "П" : 2, 
    "G" : 2, "К" : 2, "М" : 2, "У" : 2,
    "B" : 3, "Б" : 3, "C" : 3, "Г" : 3,
    "M" : 3, "Ё" : 3, "P" : 3, "Ь" : 3,
    "Я" : 3, "F" : 4, "Й" : 4, "H" : 4,
    "Ы" : 4, "V" : 4, "W" : 4, "Y" : 4,
    "K" : 5, "Ж" : 5, "З" : 5, "Х" : 5, 
    "Ч" : 5, "Ц" : 5, "J" : 8, "Ш" : 8,
    "X" : 8, "Ю" : 8, "Э" : 8, "Q" : 10, 
    "Ф" : 10, "Z" : 10, "Щ" : 10, "Ъ" : 10
}

word = "НОУТБУК"

summa = 0

for i,j in scrable.items() :
    for k in word :
        if(i == k) :
            summa += j

print(f"Накопленные очки: {summa}")